tukano-artillery-tests/logs/db-postgres-15.txt
--------------------------------
Summary report @ 17:14:28(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 18
http.codes.200: ................................................................ 2180
http.codes.204: ................................................................ 1313
http.downloaded_bytes: ......................................................... 184182
http.request_rate: ............................................................. 66/sec
http.requests: ................................................................. 3511
http.response_time:
  min: ......................................................................... 336
  max: ......................................................................... 9958
  mean: ........................................................................ 2467.4
  median: ...................................................................... 2018.7
  p95: ......................................................................... 6312.2
  p99: ......................................................................... 8692.8
http.response_time.2xx:
  min: ......................................................................... 336
  max: ......................................................................... 9958
  mean: ........................................................................ 2467.4
  median: ...................................................................... 2018.7
  p95: ......................................................................... 6312.2
  p99: ......................................................................... 8692.8
http.responses: ................................................................ 3493
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 432
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.errors.ETIME...  2
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  434
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  13
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 432
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  434
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 432
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  432
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  447
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  3
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 450
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 545
  max: ......................................................................... 9327
  mean: ........................................................................ 3300.3
  median: ...................................................................... 3011.6
  p95: ......................................................................... 6976.1
  p99: ......................................................................... 8024.5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 648
  max: ......................................................................... 9956
  mean: ........................................................................ 4080.7
  median: ...................................................................... 3678.4
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9607.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 339
  max: ......................................................................... 7155
  mean: ........................................................................ 1951.3
  median: ...................................................................... 1556.5
  p95: ......................................................................... 4492.8
  p99: ......................................................................... 6187.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 337
  max: ......................................................................... 7276
  mean: ........................................................................ 1999.5
  median: ...................................................................... 1720.2
  p95: ......................................................................... 4867
  p99: ......................................................................... 6187.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 336
  max: ......................................................................... 8948
  mean: ........................................................................ 1745.3
  median: ...................................................................... 1436.8
  p95: ......................................................................... 3905.8
  p99: ......................................................................... 5168
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 339
  max: ......................................................................... 9799
  mean: ........................................................................ 1687.6
  median: ...................................................................... 1224.4
  p95: ......................................................................... 3984.7
  p99: ......................................................................... 4867
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 442
  max: ......................................................................... 9958
  mean: ........................................................................ 2925.7
  median: ...................................................................... 2416.8
  p95: ......................................................................... 6838
  p99: ......................................................................... 8520.7
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 341
  max: ......................................................................... 9227
  mean: ........................................................................ 2045.7
  median: ...................................................................... 1587.9
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 6838
vusers.completed: .............................................................. 432
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 18
vusers.session_length:
  min: ......................................................................... 4720.7
  max: ......................................................................... 37707.8
  mean: ........................................................................ 20660.5
  median: ...................................................................... 23162.4
  p95: ......................................................................... 31266.3
  p99: ......................................................................... 34554.7